<template>
    <div class="terms-container">
      <h1>使用條例</h1>
      <section>
        <h2>一、服務條款</h2>
        <p>本站提供的各項服務，用戶應同意本條例並遵守相關法律法規，方可進行使用。</p>
      </section>
      
      <section>
        <h2>二、用戶行為規範</h2>
        <p>用戶在使用本站服務時，應遵循法律法規，不得從事非法或不正當行為，包括但不限於：</p>
        <ul>
          <li>發布或傳播違法、違規、侵犯他人權利或有害信息。</li>
          <li>濫用本站服務，進行欺詐或不正當競爭行為。</li>
          <li>進行任何可能破壞、干擾本站正常運營的行為。</li>
        </ul>
        <p>若用戶違反上述規範，本站有權進行審查，對違規帳號採取相應處理措施，包括但不限於警告、刪除違規內容、限制或禁止使用部分或全部功能、封鎖帳號等。</p>
        <p>用戶對其違反本條例而對本站或任何第三方造成的損害，應負法律責任。</p>
      </section>
      <section>
      <h2>三、內容使用政策</h2>
      <p>3.1 本站所提供的內容和資料僅供個人非商業用途，任何以其他方式使用的行為，均需得到本站的書面許可。</p>
      <p>3.2 用戶不得發布違法、不真實、侵犯他人權益的內容，否則本站有權進行刪除並保留追究法律責任的權利。</p>
    </section>
    <section>
      <h2>四、隱私政策</h2>
      <p>4.1 本站尊重並保護所有用戶的個人隱私，不會未經合法用戶授權而公開、編輯或透露用戶的非公開信息。</p>
      <p>4.2 用戶在使用本站服務時，須同意本站按照隱私政策的規定使用和披露用戶的個人信息。</p>
    </section>
    <section>
      <h2>五、法律適用和爭議解決</h2>
      <p>5.1 本條例的訂立、執行和解釋及爭議的解決均應適用中華民國法律。</p>
      <p>5.2 若用戶和本站之間發生任何爭議，應首先通過友好協商解決，協商不成的，任何一方均有權將爭議提交至本站所在地的有管轄權的法院進行訴訟解決。</p>
    </section>
    <section>
      <h2>六、用戶行為規範</h2>
      <p>6.1 用戶在使用本站服務時，應遵循法律法規，不得從事非法或不正當行為，包括但不限於：</p>
      <ul>
        <li>發布或傳播違法、違規、侵犯他人權利或有害信息。</li>
        <li>濫用本站服務，進行欺詐或不正當競爭行為。</li>
        <li>進行任何可能破壞、干擾本站正常運營的行為。</li>
      </ul>
      <p>6.2 若用戶違反上述規範，本站有權進行審查，對違規帳號採取相應處理措施，包括但不限於警告、刪除違規內容、限制或禁止使用部分或全部功能、封鎖帳號等。</p>
      <p>6.3 用戶對其違反本條例而對本站或任何第三方造成的損害，應負法律責任。</p>
    </section>
    </div>
  </template>
  
  <script>
  export default {
    name: 'Terms',
  }
  </script>
  
  <style scoped>
  .terms-container {
 padding-top:100px;
  
    max-width: 800px;
    margin: auto;
    align-items: start;
  }
  
  h1 {
    font-size: 2em;
    margin-bottom: 20px;
  }
  
  h2 {
    font-size: 1.5em;
    margin-top: 20px;
  }
  
  p {
    margin-top: 10px;
    line-height: 1.6;
  }
  
  ul {
    margin-top: 10px;
    padding-left: 20px;
  }
  </style>
  